[
  "Who here piques your curiosity even if you won't admit it?",
  "Who in the group wouldn't you trust with a secret?",
  "What desire do you hide to avoid being judged?",
  "Have you lied today?",
  "Which part of your personality do you exaggerate?",
  "Who here intimidates you the most?",
  "What thought are you ashamed to admit?",
  "Who would you avoid being alone with?",
  "What do you do when no one is watching?",
  "What lie do you tell so often that you almost believe it?",
  "Have you used someone for your own benefit?",
  "Which side of yourself do you hide best?",
  "Who would you block without explanation?",
  "What attracts you to the forbidden?",
  "Have you ever made someone jealous on purpose?",
  "What memory makes you uncomfortable?",
  "What small secret have you never told?",
  "Who here do you secretly dislike more than you let on?",
  "What would make you look bad if it became known?",
  "Have you spoken badly about someone present?",
  "What boundary did you cross once?",
  "What makes you nervous in front of others?",
  "Who in the group would you copy something from?",
  "What flaw of yours do you purposely ignore?",
  "Have you ever faked feelings?",
  "What bothers you about the group but you keep quiet about?",
  "What part of your life do you hide on social media?",
  "Who wouldn't you introduce to your family?",
  "What makes you feel guilty?",
  "What rumor about you could be true?",
  "Have you ever enjoyed making someone uncomfortable?",
  "What would you do differently if no one judged you?",
  "Who here is the most two-faced?",
  "What is hard for you to admit about yourself?",
  "What fear do you hide?",
  "Who in the group don't you fully trust?",
  "What habit do you hide?",
  "Have you betrayed someone's trust?",
  "What makes you lose emotional control?",
  "What part of your past would you erase?",
  "Who do you avoid and why?",
  "What makes you feel powerful?",
  "Have you lied to fit in?",
  "What flaw do you see in everyone but not in yourself?",
  "What situation put you in a tight spot?",
  "What are you most afraid they'll discover about you?",
  "Who did you misjudge here?",
  "What emotion do you hide the best?",
  "What would you do if no one would ever find out?",
  "What do you find hard to forgive yourself for?",
  "Who here are you hiding something from?",
  "What arouses you for no reason?",
  "What wouldn't you say in front of everyone?",
  "What do you do differently when you're alone?",
  "What are you ashamed of from your past?",
  "Who wouldn't you trust with your phone?",
  "What attracts you even though you know it's not good for you?",
  "Have you pretended to be confident?",
  "What mistake would you repeat?",
  "What part of you do people criticize the most?",
  "What bothers you about what people say about you?",
  "Who would you avoid inviting to a gathering?",
  "What do you find hard to let go of?",
  "What thought makes you uncomfortable?",
  "Have you judged someone without knowing them?",
  "What makes you feel vulnerable?",
  "What do you hide with humor?",
  "Who here could you not stand to live with?",
  "What lie saved you?",
  "What makes you feel guilty right now?",
  "What would you do if there were no consequences?",
  "Who do you envy a little?",
  "What are you afraid of losing?",
  "What do you pretend not to care about?",
  "What is hard for you to admit out loud?",
  "Who would you not forgive easily?",
  "What flaw do you tolerate in others but not in yourself?",
  "What situation left a mark on you?",
  "What do you feel uncomfortable having noticed about you?",
  "What do you hide to fit in?",
  "What makes you feel insecure?",
  "Who would you avoid helping?",
  "What makes you feel judged?",
  "What is hard for you to control?",
  "What part of yourself don't you like?",
  "What do you hide with silence?",
  "Who wouldn't you trust to make a decision?",
  "What are you embarrassed to remember?",
  "What emotion do you suppress?",
  "What would you do differently today?",
  "What makes you uncomfortable to admit?",
  "Who wouldn't you tell the truth to?",
  "What makes you doubt yourself?",
  "What is hard for you to accept?",
  "What do you hide with pride?",
  "What arouses you for no reason?",
  "What weighs on you from the past?",
  "What wouldn't you say in front of your family?",
  "What do you find hard to let go?",
  "Which part of you do you hide best?"
]
